artifacts/packs/openfoam-ecm-standalone_lumped_debug_20260330_112500/cases/lumped_solid/constant/jellyRoll/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/jellyRoll/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    jellyRoll_to_shell
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          18184;
        startFace       145416;
        sampleMode      nearestPatchFace;
        sampleRegion    shell;
        samplePatch     shell_to_jellyRoll;
    }
    jellyRoll_to_cap
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          1160;
        startFace       163600;
        sampleMode      nearestPatchFace;
        sampleRegion    cap;
        samplePatch     cap_to_jellyRoll;
    }
)

// ************************************************************************* //
