artifacts/packs/openfoam-ecm-standalone_lumped_debug_20260330_112500/cases/lumped_solid/0/shell/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/shell";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    shell_to_ambient
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    shell_to_jellyRoll
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    shell_to_cap
    {
        type            calculated;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
